---   

<h1 align="center">Introduction to Data Analyst and Data Science for beginners</h1>
<h1 align="center">Introduction to DBMS and SQL for beginners</h1>

---
<h3><div align="right">Ehtisham Sadiq</div></h3>

# Learning Agenda of this Notebook:
- What is Data?
- What is Database?
- Famous types of Databases
- What is RDBMS?
- DBMS vs RDBMS?
- What is SQL?
- SQL vs MySQL
- Why SQL?
- Types of SQL Commands?
 >- DDL
 >- DML
 >- DCL
 >- TCL
 >- DQL
- Difference between SQL AND NoSQL
- Advantages and Dis-advantages of SQL
- What is SQL Syntax?
- Datatypes in SQL
- SQL Operators
- What is SQL Statement?
- SQL Database Commands
 >- SQL CREATE Database
 >- SQL DROP Database
 >- SQL RENAME Database
 >- SQL SELECT Database
 
- SQL Table Commands
 >- What is Table
 >- SQL CREATE TABLE
 >- SQL DROP TABLE
 >- SQL DELETE TABLE
 >- SQL RENAME TABLE
 >- SQL TRUNCATE TABLE
 >- SQL COPY TABLE
 >- SQL TEMP TABLE
 >- SQL ALTER TABLE
 
- SQL SELECT Commands
 >- SELECT Statement
 >- SQL SELECT UNIQUE
 >- SQL SELECT DISTINCT
 >- SQL SELECT COUNT
 >- SQL SELECT TOP
 >- SQL SELECT FIRST
 >- SQL SELECT LAST
 >- SQL SELECT RANDOM
 >- SQL SELECT IN
 >- SQL SELECT Multiple
 >- SQL SELECT DATE
 >- SQL SELECT SUM
 >- SQL SELECT NULL

- SQL Clause
>- SQL WHERE
>- SQL AND
>- SQL OR
>- SQL WITH
>- SQL AS
>- SQL HAVING Clause

- SQL Order By
>- ORDER BY Clause
>- ORDER BY ASC
>- ORDER BY DESC
>- ORDER BY RANDOM
>- ORDER BY LIMIT
>- ORDER BY Multiple Cols

- SQL Insert commands
>- INSERT Statement
>- INSERT INTO Values
>- INSERT INTO SELECT
>- INSERT Multiple Rows

- SQL Update
>- UPDATE Statement
>- SQL UPDATE JOIN
>- SQL UPDATE DATE

- SQL Delete
>- DELETE Statement
>- SQL DELETE TABLE
>- SQL DELETE ROW
>- SQL DELETE All Rows
>- DELETE Duplicate Rows
>- SQL DELETE DATABASE
>- SQL DELETE VIEW
>- SQL DELETE JOIN

- SQL Join commands
>- SQL JOIN
>- SQL Outer Join
>- SQL Left Join
>- SQL Right Join
>- SQL Full Join
>- SQL Cross Join

- SQL Keys
>- Primary Key
>- Foreign Key
>- Composite Key
>- Unique Key
>- Alternate Key

- SQL Data Types
 >- String Data types
 >- Numeric Data types
 >- Date and time Data types
- SQL Operators
 >- What is SQL Operator?
 >- What is the Precedence of SQL Operator?
 >- Types of Operator
  - SQL Arithmetic Operators
  >- SQL Comparison Operators
  >- SQL Logical Operators
  >- SQL Set Operators
  >- SQL Bit-wise Operators
  >- SQL Unary Operators
  
- Difference
>- IN vs EXISTS
>- Group By vs Order By
>- WHERE vs HAVING
>- Where condition in SQL

- Interview Questions Answers
- Case Studies
- Python MySQL
 >- Environment Setup
 >- Database Connection
 >- Creating New Database
 >- Creating Tables
 >- Insert Operation
 >- Read Operation
 >- Update Operation
 >- Join Operation
 >- Performing Transactions

# What is Data?
- Data is a collection of a distinct small unit of information. It can be used in a variety of forms like text, numbers, media, bytes, etc. it can be stored in pieces of paper or electronic memory, etc.
- In computing, Data is information that can be translated into a form for efficient movement and processing. Data is interchangeable.

# What is Database?
- A database is an organized collection of data, so that it can be easily accessed and managed.
- You can organize data into tables, rows, columns, and index it to make it easier to find relevant information.
- Database handlers create a database in such a way that only one set of software program provides access of data to all the users.
- The main purpose of the database is to operate a large amount of information by storing, retrieving, and managing data.
- There are many dynamic websites on the World Wide Web nowadays which are handled through databases. For example, a model that checks the availability of rooms in a hotel. It is an example of a dynamic website that uses a database.
- There are many databases available like MySQL, Sybase, Oracle, MongoDB, Informix, PostgreSQL, SQL Server, etc.
- Modern databases are managed by the database management system (DBMS).
- SQL or Structured Query Language is used to operate on the data stored in a database. SQL depends on relational algebra and tuple relational calculus.

# Types of Databases:
There are various types of databases used for storing different varieties of data.
![](types-of-databases.png)

### Centralized Database
- It is the type of database that stores data at a centralized database system. It comforts the users to access the stored data from different locations through several applications. These applications contain the authentication process to let users access data securely. 
- An example of a Centralized database can be Central Library that carries a central database of each library in a college/university.

### Distributed Database
- Unlike a centralized database system, in distributed systems, data is distributed among different database systems of an organization. These database systems are connected via communication links. Such links help the end-users to access the data easily. 
- Examples of the Distributed database are Apache Cassandra, HBase, Ignite, etc.

### Relational Database
- This database is based on the relational data model, which stores data in the form of rows(tuple) and columns(attributes), and together forms a table(relation). A relational database uses SQL for storing, manipulating, as well as maintaining the data. E.F. Codd invented the database in 1970. Each table in the database carries a key that makes the data unique from others. 
- Examples of Relational databases are MySQL, Microsoft SQL Server, Oracle, etc.

<img src="images/Relational_theory.png">

### NoSQL Database
Non-SQL/Not Only SQL is a type of database that is used for storing a wide range of data sets. It is not a relational database as it stores data not only in tabular form but in several different ways. It came into existence when the demand for building modern applications increased. Thus, NoSQL presented a wide variety of database technologies in response to the demands.

### Cloud Database
A type of database where data is stored in a virtual environment and executes over the cloud computing platform. It provides users with various cloud computing services (SaaS, PaaS, IaaS, etc.) for accessing the database. There are numerous cloud platforms, but the best options are:

- Amazon Web Services(AWS)
- Microsoft Azure
- Kamatera
- PhonixNAP
- ScienceSoft
- Google Cloud SQL, etc.

### Object-oriented Databases
The type of database that uses the object-based data model approach for storing data in the database system. The data is represented and stored as objects which are similar to the objects used in the object-oriented programming language.

### Hierarchical Databases
- It is the type of database that stores data in the form of parent-children relationship nodes. Here, it organizes data in a tree-like structure.
- Data get stored in the form of records that are connected via links. Each child record in the tree will contain only one parent. On the other hand, each parent record can have multiple child records.

<img src="images/types-of-databases4 (1).png">

### Personal Database
Collecting and storing data on the user's system defines a Personal Database. This database is basically designed for a single user.

# What is RDBMS (Relational Database Management System)
- `RDBMS` stands for Relational Database Management System.
- All modern database management systems like SQL, MS SQL Server, IBM DB2, ORACLE, My-SQL, and Microsoft Access are based on RDBMS.
- It is called Relational Database Management System (RDBMS) because it is based on the relational model introduced by E.F. Codd.

### How it works
- Data is represented in terms of tuples (rows) in RDBMS.
- A relational database is the most commonly used database. It contains several tables, and each table has its primary key.
- Due to a collection of an organized set of tables, data can be accessed easily in RDBMS.
<img src="images/what-is-rdbms (1).png">

# Difference between DBMS and RDBMS
### DBMS:
- DBMS applications store data as file.
- In DBMS, data is generally stored in either a hierarchical form or a navigational form.
- DBMS uses file system to store data, so there will be no relation between the tables.
- DBMS has to provide some uniform methods to access the stored information.
- DBMS does not support distributed database.
- DBMS is meant to be for small organization and deal with small data. it supports single user.
- Examples of DBMS are file systems, xml etc.

### RDBMS:
- RDBMS applications store data in a tabular form.
- In RDBMS, the tables have an identifier called primary key and the data values are stored in the form of tables.
- In RDBMS, data values are stored in the form of tables, so a relationship between these data values will be stored in the form of a table as well.
- RDBMS system supports a tabular structure of the data and a relationship between them to access the stored information.
- RDBMS supports distributed database.
- RDBMS is designed to handle large amount of data. it supports multiple users.
- Example of RDBMS are mysql, postgre, sql server, oracle etc.

# What is SQL?
- SQL is a short-form of the structured query language.
- This database language is mainly designed for maintaining the data in relational database management systems. It is a special tool used by data professionals for handling structured data (data which is stored in the form of tables). It is also designed for stream processing in RDSMS.
- You can easily create and manipulate the database, access and modify the table rows and columns, etc.

# SQL vs MySQL
<img src="images/Difference-Between-SQL-and-MySQL-Comparison-Summary.jpg" height=600px width=600px>

# Why SQL?
Nowadays, SQL is widely used in data science and analytics. Following are the reasons which explain why it is widely used:

- The basic use of SQL for data professionals and SQL users is to insert, update, and delete the data from the relational database.
- SQL allows the data professionals and users to retrieve the data from the relational database management systems.
- It also helps them to describe the structured data.
- It allows SQL users to create, drop, and manipulate the database and its tables.
- It also helps in creating the view, stored procedure, and functions in the relational database.
- It allows you to define the data and modify that stored data in the relational database.
- It also allows SQL users to set the permissions or constraints on table columns, views, and stored procedures.

<img src='images/60115data scientist skills.png'>

## Key elements of SQL for Data Science
Following are the key aspects of SQL which are most useful for Data Science. Every aspiring Data Scientists must know these necessary SQL skills and features.
<img src='images/91429sql for data science.jpg'>

# Types of SQL Commands
- SQL commands are instructions. It is used to communicate with the database. It is also used to perform specific tasks, functions, and queries of data.
- SQL can perform various tasks like create a table, add data to tables, drop the table, modify the table, set permission for users.
### Types of SQL Commands
- There are five types of SQL commands: DDL, DML, DCL, TCL, and DQL.
<img src=" images/dbms-sql-command (1).png">

### Data Definition Language (DDL)
- DDL changes the structure of the table like creating a table, deleting a table, altering a table, etc.
- All the command of DDL are auto-committed that means it permanently save all the changes in the database.
Here are some commands that come under DDL:
 >- CREATE(t is used to create a new table in the database.)
 >- ALTER (It is used to delete both the structure and record stored in the table.)
 >- DROP (It is used to alter the structure of the database. This change could be either to modify the characteristics of an existing attribute or probably to add a new attribute.)
 >- TRUNCATE ( It is used to delete all the rows from the table and free the space containing the table.)
 
 
### Data Manipulation Language
- DML commands are used to modify the database. It is responsible for all form of changes in the database.
- The command of DML is not auto-committed that means it can't permanently save all the changes in the database. They can be rollback.
Here are some commands that come under DML:

 >- INSERT(The INSERT statement is a SQL query. It is used to insert data into the row of a table.)
 >- UPDATE(This command is used to update or modify the value of a column in the table.)
 >- DELETE(It is used to remove one or more row from a table.)
 
 
### Data Control Language
- DCL commands are used to grant and take back authority from any database user.
Here are some commands that come under DCL:
 >- grant(It is used to give user access privileges to a database)
 >- Revoke(It is used to take back permissions from the user.)


### Transaction Control Language
- TCL commands can only use with DML commands like INSERT, DELETE and UPDATE only.
- These operations are automatically committed in the database that's why they cannot be used while creating tables or dropping them.
Here are some commands that come under TCL:
 >- COMMIT(Commit command is used to save all the transactions to the database.)
 >- ROLLBACK(Rollback command is used to undo transactions that have not already been saved to the database.)
 >- SAVEPOINT(It is used to roll the transaction back to a certain point without rolling back the entire transaction.)
 
### Data Query Language
- DQL is used to fetch the data from the database.
It uses only one command:
 >- SELECT(This is the same as the projection operation of relational algebra. It is used to select the attribute based on the condition described by WHERE clause.)

# SQL vs NoSQL
- Databases are categorized as Relational Database Management System (RDBMS) while NoSQL databases are categorized as Non-relational or distributed database system.
- SQL databases have fixed or static or predefined schema while NoSQL databases have dynamic schema.
- SQL databases display data in form of tables so it is known as table-based database while NoSQL databases display data as collection of key-value pair, documents, graph databases or wide-column stores.
- SQL databases are vertically scalable while NoSQL databases are horizontally scalable.
- SQL databases are not best suited for hierarchical data storage while NoSQL databases are best suited for hierarchical data storage.
- MySQL, Oracle, Sqlite, PostgreSQL and MS-SQL etc. are the example of SQL database while MongoDB, BigTable, Redis, RavenDB, Cassandra, Hbase, Neo4j, CouchDB etc. are the example of nosql database
<img src="images/nosql_vs_sql-1024x724 (1).jpeg" height=600px width=600px >

# Advantages and Disadvantages of SQL
### Advantages:
- No programming needed
- High Speed Query Processing
- Standardized Language
- Portability
- Interactive language
- More than one Data View

### Disadvantages
- Cost
- Interface is Complex
- Partial Database control

# SQL Syntax
When you want to do some operations on the data in the database, then you must have to write the query in the predefined syntax of SQL.
Following are some most important points about the SQL syntax which are to remember:
- You can write the keywords of SQL in both uppercase and lowercase, but writing the SQL keywords in uppercase improves the readability of the SQL query.
- SQL statements or syntax are dependent on text lines. We can place a single SQL statement on one or multiple text lines.
- You can perform most of the action in a database with SQL statements.
- SQL syntax depends on relational algebra and tuple relational calculus.

# SQL Statement
- SQL statements tell the database what operation you want to perform on the structured data and what information you would like to access from the database.

- The statements of SQL are very simple and easy to use and understand. They are like plain English but with a particular syntax.

#### Simple Example of SQL statement:

`SELECT "column_name" FROM "table_name";`     
Each SQL statement begins with any of the SQL keywords and ends with the semicolon (;). The semicolon is used in the SQL for separating the multiple Sql statements which are going to execute in the same call. In this SQL tutorial, we will use the semicolon (;) at the end of each SQL query or statement.

# Datatypes in SQL
### MySQL String Data Types:

- CHAR(Size)
 >- It is used to specify a fixed length string that can contain numbers, letters, and special characters. Its size can be 0 to 255 characters. Default is 1.
- VARCHAR(Size)	
 >- It is used to specify a variable length string that can contain numbers, letters, and special characters. Its size can be from 0 to 65535 characters.
- BINARY(Size)	
 >- It is equal to CHAR() but stores binary byte strings. Its size parameter specifies the column length in the bytes. Default is 1.
- VARBINARY(Size)	
 >- It is equal to VARCHAR() but stores binary byte strings. Its size parameter specifies the maximum column length in bytes.
- TEXT(Size)	
 >- It holds a string that can contain a maximum length of 255 characters.
- MEDIUMTEXT	
 >- It holds a string with a maximum length of 16,777,215.

### MySQL Numeric Data Types
- BIT(Size)
 >- It is used for a bit-value type. The number of bits per value is specified in size. Its size can be 1 to 64. The default value is 1.
- INT(size)
 >- It is used for the integer value. Its signed range varies from -2147483648 to 2147483647 and unsigned range varies from 0 to 4294967295. The size parameter specifies the max display width that is 255.
- FLOAT(size, d)
 >- It is used to specify a floating point number. Its size parameter specifies the total number of digits. The number of digits after the decimal point is specified by d parameter.
- DOUBLE(size, d)
 >- It is a normal size floating point number. Its size parameter specifies the total number of digits. The number of digits after the decimal is specified by d parameter.
- DECIMAL(size, d)
 >- It is used to specify a fixed point number. Its size parameter specifies the total number of digits. The number of digits after the decimal parameter is specified by d parameter. The maximum value for the size is 65, and the default value is 10. The maximum value for d is 30, and the default value is 0.
- BOOL
 >- It is used to specify Boolean values true and false. Zero is considered as false, and nonzero values are considered as true.

### MySQL Date and Time Data Types
- DATE
 >- It is used to specify date format YYYY-MM-DD. Its supported range is from '1000-01-01' to '9999-12-31'.
- DATETIME(fsp)
 >- It is used to specify date and time combination. Its format is YYYY-MM-DD hh:mm:ss. Its supported range is from '1000-01-01 00:00:00' to 9999-12-31 23:59:59'.
- YEAR	
 >- It is used to specify a year in four-digit format. Values allowed in four digit format from 1901 to 2155, and 0000.

# SQL Database Commands

#### 1. CREATE Database:
This command is used in MySQL to create the new database for storing the structured data.
#### Syntax:
CREATE DATABASE database_name;

#### 2. SHOW Database:
This command shows all the databases in our database.
#### Syntax:
SHOW Databases;

#### 3. SQL DROP Database
The SQL Drop Database statement deletes the existing database permanently from the database system. This statement deletes all the views and tables if stored in the database, so be careful while using this query in SQL.

Following are the most important points which are required to learn before removing the database from the database system:
- This statement deletes all the data from the database. If you want to restore the deleted data in the future, you should keep the backup of data of that database which you want to delete.
- Another most important point is that you cannot delete that database from the system which is currently in use by another database user. If you do so, then the drop statement shows the following error on screen:   
`Cannot drop database "name_of_the_database" because it is currently in use.`   
#### Syntax: 
DROP DATABASE database_name;

We can also delete multiple databases easily by using the single DROP syntax:

`DROP DATABASE Database_Name1, Database_Name2, ......., Database_NameN;  `

#### 4. SQL USE Command
#### Syntax of USE statement in SQL
`USE database_name;`
In this syntax, we have to define the name of the database after the USE keyword and the name of the database must be unique.

### Example 1: 
Suppose, you want to work with the `Hospital` database. For this firstly, you have to check that if the Hospital database exists on the current database server or not by using the following query:     
`SHOW DATABASES;`      

If the Hospital database is shown in the output, then you have to execute the following query to select the Hospital database:

`USE Hospital`;

### Example 2: 
Suppose, you want to work with another `College` database in SQL. For this firstly, you have to check that the College database exists on the current database server or not by using the following query:

`SHOW DATABASES;`  

If the College database is shown in the result, then you have to execute the following query to select the College database:

`USE College;`

# SQL TABLE Commands
- Table is a collection of data, organized in terms of rows and columns. In DBMS term, table is known as relation and rowS as tuple.
### 1. SQL TABLE Variable
The SQL Table variable is used to create, modify, rename, copy and delete tables. Table variable was introduced by Microsoft.
- Table variables are used to store a set of records. So declaration syntax generally looks like CREATE TABLE syntax.

```
create table "tablename"  
("column1" "data type",  
"column2" "data type",  
...  
"columnN" "data type");  
```
- When a transaction rolled back the data associated with table variable is not rolled back.

- A table variable generally uses lesser resources than a temporary variable.

- Table variable cannot be used as an input or an output parameter.

### 2. SQL CREATE TABLE
- SQL CREATE TABLE statement is used to create table in a database.
- If you want to create a table, you should name the table and define its column and each column's data type.

Let's see the simple syntax to create the table.
```
create table "tablename"  
("column1" "data type",  
"column2" "data type",  
"column3" "data type",  
...  
"columnN" "data type");  
```

- The data type of the columns may vary from one database to another. For example, NUMBER is supported in Oracle database for integer value whereas INT is supported in MySQL.

### Example 3:
Create a database `College` , in this database create a table  `STUDENTS` with ID as primary key and NOT NULL are the constraint showing that these fields cannot be NULL while creating records in the table. Other columns names are name, age, address.

```
CREATE TABLE STUDENTS (  
ID INT                           NOT NULL,  
NAME VARCHAR (20) NOT NULL,  
AGE INT                         NOT NULL,  
ADDRESS CHAR (25),  
PRIMARY KEY (ID)  
);  
```

Note:
 >- DESC command is used to give the descriptive view of database table.

### 3. Create a Table using another table
- We can create a copy of an existing table using the create table command. The new table gets the same column signature as the old table. We can select all columns or some specific columns.
- If we create a new table using an old table, the new table will be filled with the existing value from the old table.



```
CREATE TABLE table_name  AS  
SELECT column1, column2,...   
FROM old_table_name WHERE ..... ;  
```
### Example: 
The following SQL creates a copy of the employee table.  
```
CREATE TABLE EmployeeCopy AS  
SELECT EmployeeID, FirstName, Email  
FROM Employee;  
```

### 4. SQL Primary Key with CREATE TABLE Statement
The following query creates a PRIMARY KEY on the `ID` column when the "Employee" table is created.
```
CREATE TABLE Employee(  
EmployeeID NOT NULL,  
FirstName varchar(255) NOT NULL,  
LastName varchar(255),  
City varchar(255),  
PRIMARY KEY (EmployeeID)  
); 
```

### 5. SQL DROP TABLE
- A SQL DROP TABLE statement is used to delete a table definition and all data from a table.
- This is very important to know that once a table is deleted all the information available in the table is lost forever, so we have to be very careful when using this command.

#### Syntax:
`DROP TABLE "table_name";  `

### 6. SQL DELETE TABLE
The DELETE statement is used to delete rows from a table. If you want to remove a specific row from a table you should use WHERE condition.

```
DELETE FROM table_name [WHERE condition];  
```
But if you do not specify the WHERE condition it will remove all the rows from the table.

```
DELETE FROM table_name;
```
There are some more terms similar to DELETE statement like as DROP statement and TRUNCATE statement but they are not exactly same there are some differences between them.

### Difference between DELETE and TRUNCATE statements
- There is a slight difference b/w delete and truncate statement. The DELETE statement only deletes the rows from the table based on the condition defined by WHERE clause or delete all the rows from the table when condition is not specified.
- But it does not free the space containing by the table.
- The TRUNCATE statement: it is used to delete all the rows from the table and free the containing space.

### Difference b/w DROP and TRUNCATE statements
When you use the drop statement it deletes the table's row together with the table's definition so all the relationships of that table with other tables will no longer be valid.

When you drop a table:

 >- Table structure will be dropped
 >- Relationship will be dropped
 >- Integrity constraints will be dropped
 >- Access privileges will also be dropped
 
On the other hand when we `TRUNCATE` a table, the table structure remains the same, so you will not face any of the above problems.

### 7. SQL RENAME TABLE
- Any database user can easily change the name by using the RENAME TABLE and ALTER TABLE statement in Structured Query Language.
- The RENAME TABLE and ALTER TABLE syntax help in changing the name of the table.
### Syntax
```
RENAME TABLE old_table _name To new_table_name ;    
```

### 8. SQL TRUNCATE TABLE
- A truncate SQL statement is used to remove all rows (complete data) from a table. It is similar to the DELETE statement with no WHERE clause.
- Truncate table is faster and uses lesser resources than DELETE TABLE command.
- Drop table command can also be used to delete complete table but it deletes table structure too. TRUNCATE TABLE doesn't delete the structure of the table.
Syntax: 
```
TRUNCATE TABLE table_name;  
```

### 9. SQL COPY TABLE
- If you want to copy the data of one SQL table into another SQL table in the same SQL server, then it is possible by using the SELECT INTO statement in SQL.

- The SELECT INTO statement in Structured Query Language copies the content from one existing table into the new table. SQL creates the new table by using the structure of the existing table.

### Syntax of SELECT INTO statement in SQL
```
SELECT * INTO New_table_name FROM old_table_name;  
```

### Syntax of SELECT INTO statement with WHERE clause in SQL
```
SELECT * INTO New_table_name FROM old_table_name WHERE [ condition ] ;  
```

### 10. SQL ALTER TABLE
- The ALTER TABLE statement in Structured Query Language allows you to add, modify, and delete columns of an existing table. This statement also allows database users to add and remove various SQL constraints on the existing tables.
- Any user can also change the name of the table using this statement.
### ALTER TABLE ADD Column statement in SQL
In many situations, you may require to add the columns in the existing table. Instead of creating a whole table or database again you can easily add single and multiple columns using the ADD keyword.

### Syntax of ALTER TABLE ADD Column statement in SQL
```
ALTER TABLE table_name ADD column_name column-definition;
```

The above syntax only allows you to add a single column to the existing table. If you want to add more than one column to the table in a single SQL statement, then use the following syntax:
```
ALTER TABLE table_name     
ADD (column_Name1 column-definition,    
column_Name2 column-definition,    
.....    
column_NameN column-definition);    
```

#### ALTER TABLE MODIFY Column statement in SQL
The MODIFY keyword is used for changing the column definition of the existing table.

#### Syntax of ALTER TABLE MODIFY Column statement in SQL
```
ALTER TABLE table_name MODIFY column_name column-definition;  
```
This syntax only allows you to modify a single column of the existing table. If you want to modify more than one column of the table in a single SQL statement, then use the following syntax:

```
ALTER TABLE table_name     
MODIFY (column_Name1 column-definition,    
column_Name2 column-definition,    
.....    
column_NameN column-definition);    
```

#### ALTER TABLE DROP Column statement in SQL
In many situations, you may require to delete the columns from the existing table. Instead of deleting the whole table or database you can use DROP keyword for deleting the columns.

#### Syntax of ALTER TABLE DROP Column statement in SQL
```
ALTER TABLE table_name DROP Column column_name ;  
```
#### Note:
```
This is equal to del df['col'] in pandas library.
```

#### ALTER TABLE RENAME Column statement in SQL
The RENAME keyword is used for changing the name of columns or fields of the existing table.

#### Syntax of ALTER TABLE RENAME Column statement in SQL
```
ALTER TABLE table_name RENAME COLUMN old_name to new_name;   
```
#### Note:
```
This is equal to df.rename(columns={"oldName":"NewName"}, inplace=True)
```.

# SQL SELECT Statement
The SELECT statement is the most commonly used command in Structured Query Language. It is used to access the records from one or more database tables and views. It also retrieves the selected data that follow the conditions we want.

#### Syntax of SELECT Statement in SQL
```
SELECT Column_Name_1, Column_Name_2, ....., Column_Name_N FROM Table_Name;  
```

If you want to access all rows from all fields of the table, use the following SQL SELECT syntax with * asterisk sign:
```
SELECT * FROM table_name;  
```
#### Note:
```
This is equal to df[[col1,col2,col2]].
```

#### SELECT Statement with WHERE clause
- The WHERE clause is used with SELECT statement to return only those rows from the table, which satisfy the specified condition in the query.

- In SQL, the WHERE clause is not only used with SELECT, but it is also used with other SQL statements such as UPDATE, ALTER, and DELETE statements.

#### Syntax of SELECT Statement with WHERE clause
```
SELECT * FROM Name_of_Table WHERE [condition];  
```
#### Note:
```
This is equal to df[df[col]=='condition'].
```

### Example : Select all the student from the table `student` whose belong to `Lahore`.
##### Note: This is similar to pandas syntax
```
df[df['Address'] =='Lahore']
```

#### SQL SELECT Statement with GROUP BY clause
- The GROUP BY clause is used with the SELECT statement to show the common data of the column from the table:

#### Syntax of SELECT Statement with GROUP BY clause
```
SELECT column_Name_1, column_Name_2, ....., column_Name_N aggregate_function_name(column_Name2) FROM table_name GROUP BY column_Name1;  
```

### Example:
SELECT COUNT(Grade), Age FROM Student_Records sr  GROUP BY Age;  

#### Note : 
```
This is equal pd.crosstab(df.col1, df.col2) pandas.

```

#### SQL SELECT Statement with HAVING clause
The HAVING clause in the SELECT statement creates a selection in those groups which are defined by the GROUP BY clause.

#### Syntax of SELECT Statement with HAVING clause
```
SELECT column_Name_1, column_Name_2, ....., column_Name_N aggregate_function_name(column_Name_2) FROM table_name GROUP BY column_Name1 HAVING ;
```

### Example: Display the total salary of those employees having more than 5000 from the  Employee_Having table.

```
SELECT SUM(Employee_Salary), Employee_Name 
FROM ehtisham.Employee_Having eh 
GROUP BY Employee_Name 
HAVING SUM(Employee_Salary)>40000;
```

or 

```
SELECT Employee_Salary, Employee_Name,Employee_City 
FROM ehtisham.Employee_Having eh 
WHERE Employee_Salary > 40000;
```

#### Note:
```
This is equal to df[(df.Age >= 20) & (df.First_Name)].
```

#### SELECT Statement with ORDER BY clause
- The ORDER BY clause with the SQL SELECT statement shows the records or rows in a sorted manner.
- The ORDER BY clause arranges the values in both ascending and descending order. Few database systems arrange the values of column in ascending order by default.

#### Syntax of SELECT Statement with ORDER BY clause
```
SELECT Column_Name_1, Column_Name_2, ....., column_Name_N FROM table_name 
WHERE [Condition] ORDER BY[column_Name_1, column_Na];
```

### Example: Sorts the salary of employees in descending order from the  Employee_Having Table.
```
SELECT * FROM ehtisham.Employee_Having eh 
ORDER BY Employee_Salary desc;
```
### Example: Sorts the percentage of students in descending order from the Student_Records Table.

```
SELECT * FROM ehtisham.Student_Records sr 
ORDER BY Percentage ASC;
```
#### Note: 
```
This is equal to df.sort_values('Percentage', ascending=True) in pandas.
```

# SQL SELECT UNIQUE
- Actually, there is no difference between DISTINCT and UNIQUE.
- In simple words, we can say that SELECT UNIQUE statement is used to retrieve a unique or distinct element from the table.

Syntax:
```
SELECT UNIQUE column_name  
FROM table_name;  
```

### Example: Select Unique Values from Age column of Student_Records Table.
This is similar to:   
```
df['Age'].unique()
```

## SQL SELECT DISTINCT
- The SQL DISTINCT command is used with SELECT key word to retrieve only distinct or unique data.

- In a table, there may be a chance to exist a duplicate value and sometimes we want to retrieve only unique values. In such scenarios, SQL SELECT DISTINCT statement is used.

#### Note: SQL SELECT UNIQUE and SQL SELECT DISTINCT statements are same.
#### Syntax:
```
SELECT DISTINCT column_name ,column_name  
FROM  table_name; 
```

#### Note:
```
This is equal to df['col'].unique() method of pandas.
```

## SQL SELECT COUNT
- The SQL COUNT() is a function that returns the number of records of the table in the output.
- This function is used with the SQL SELECT statement.
#### Example:
If you have a record of the voters in the selected area and want to count the number of voters, then it is very difficult to do it manually, but you can do it easily by using SQL SELECT COUNT query.

#### Syntax:
```
SELECT COUNT(column_name) FROM table_name;  
OR 
SELECT COUNT(location) AS TotalCountries from ranking.DataTable dt ; 
```
#### Note:
```
This is equal to len(df['col']), df['col'].size, df['col'].shape method of pandas.
```

### Select Count(*) Function in SQL
- The count(*) function in SQL shows all the Null and Non-Null records present in the table.

#### Syntax:
```
SELECT COUNT(*) FROM table_name;  
```
#### Note:
```
This is equal to len(df), df.size, df.shape method of pandas.
```

### SQL Count() Function With WHERE Clause
- We can also use the Count() function with the WHERE clause. The Count Function with WHERE clause in the SELECT statement shows those records that matched the specified criteria.

#### Syntax:
```
SELECT COUNT(column_name) FROM table_name WHERE [condition];  
```
#### Note:
```
This is equal to len(df=='condition), df=='condition'.size, df.shape method of pandas.
```

## Example:
```
SELECT COUNT(*) FROM ranking.DataTable dt 
WHERE `location code` ='UK';
```

### SQL Count Function With DISTINCT keyword
- The DISTINCT keyword with the COUNT function shows only the numbers of unique rows of a column.

#### Syntax:
```

SELECT COUNT(DISTINCT column_name) FROM table_name WHERE [condition];  

```
#### Note:
```
This is equal to len(df['col'].unique()) method of pandas.
```

## SQL SELECT TOP
- The SELECT TOP statement in SQL shows the limited number of records or rows from the database table. The TOP clause in the statement specifies how many rows are returned.

- It shows the top N number of rows from the tables in the output. This clause is used when there are thousands of records stored in the database tables.

### Note: 
- All the database systems do not support the TOP keyword for selecting the limited number of records. Oracle supports the ROWNUM keyword, and MySQL supports the LIMIT keyword.

### Syntax of LIMIT Clause in MySQL
```
SELECT column_Name1,column_Name2, ....., column_NameN FROM table_name LIMIT value;  
```

- In the syntax, we have to specify the value after the LIMIT keyword. The value denotes the number of rows to be shown from the top in the output.

#### Note:
- This is equal to df.head() of pandas library.

## Example:
```    
SELECT  * FROM ranking.DataTable dt 
LIMIT 5;
```

### EXAMPLE
```
SELECT * 
FROM ranking.DataTable dt 
WHERE `location code`  = 'US'
LIMIT 3;
```

## SQL SELECT RANDOM
- The SQL SELECT RANDOM() function returns the random row. It can be used in online exam to display the random questions.

- There are a lot of ways to select a random record or row from a database table. Each database server needs different SQL syntax.

#### Syntax:

```
SELECT column FROM table  
ORDER BY RAND ( )  
LIMIT 1  
```
#### Note:
```
This is equal to df.sample() method.
```

### Example:
```
SELECT * FROM ranking.DataTable dt 
ORDER BY RAND()
LIMIT 5;
```

## SQL SELECT AS
- SQL 'AS' is used to assign a new name temporarily to a table column or even a table.
- It makes an easy presentation of query results and allows the developer to label results more accurately without permanently renaming table columns or even the table itself.
#### Syntax:
```
SELECT Column_Name1 AS New_Column_Name, Column_Name2  As New_Column_Name FROM Table_Name;  
```

## Example 1:

Write a query to get the student name and the average of the percentage of the student under the temporary column name 'Student' and 'Student_Percentage', respectively.

## Query:
```
SELECT Student_Name AS Student, AVG (Student_Percentage) AS Average_Percentage FROM students;  
```

## Example 2:
Write a query to get the student roll number and the student mobile number under the temporary column name 'Roll No' and 'Mobile Number', respectively.
## Query:
SELECT Student_RollNo AS 'Roll No', Student_PhoneNumber AS 'Mobile Number' FROM students;

## Example 3:
Write a query to get the student roll number and the student phone number, home town under the temporary column name 'Roll No' and 'Student_Info', respectively.

## Query:
```
SELECT Student_RollNo AS 'Roll No', CONCAT (Student_PhoneNumber, ', ', Student_HomeTown) AS Student_Info FROM students; 
```
#### Note : 
- Here, the CONCAT () function combines two different columns, student phone number and the home town, together in a single column. Further, the combined values of both these columns are stored under the temporarily assigned name 'Student_Info'.

### Assigning a temporary name to a table
- Instead of remembering the table names, we can create an alias of them. We can assign a temporary name to the columns of a table; similarly, we can create an alias of a table.

- Write a query to create an alias of a table named 'students'.

### Query:
```
SELECT s.Student_RollNo, s.Student_Name, s.Student_Gender, s.Student_PhoneNumber, s.Student_HomeTown FROM students AS s WHERE s.Student_RollNo = 3;  
```

## HAVING Clause in SQL
- The HAVING clause places the condition in the groups defined by the GROUP BY clause in the SELECT statement.
- This SQL clause is implemented after the 'GROUP BY' clause in the 'SELECT' statement.
- This clause is used in SQL because we cannot use the WHERE clause with the SQL aggregate functions. Both WHERE and HAVING clauses are used for filtering the records in SQL queries.

### Difference between HAVING and WHERE Clause
- The difference between the WHERE and HAVING clauses in the database is the most important question asked during an IT interview.
- The HAVING clause is used in database systems to fetch the data/values from the groups according to the given condition while The WHERE clause is used in database systems to fetch the data/values from the tables according to the given condition.
- The HAVING clause is always executed with the GROUP BY clause while The WHERE clause can be executed without the GROUP BY clause.
- The HAVING clause can include SQL aggregate functions in a query or statement while We cannot use the SQL aggregate function with WHERE clause in statements.
- We can only use SELECT statement with HAVING clause for filtering the records while Whereas, we can easily use WHERE clause with UPDATE, DELETE, and SELECT statements.
- The HAVING clause is used in SQL queries after the GROUP BY clause while The WHERE clause is always used before the GROUP BY clause in SQL queries.
- We can implements this SQL clause in column operations while We can implements this SQL clause in row operations.
- It is a post-filter while It is a pre-filter.
- It is used to filter groups while It is used to filter the single record of the table.

### Syntax of HAVING clause:
```
SELECT column_Name1, column_Name2, ....., column_NameN aggregate_function_name(column_Name) FROM table_name GROUP BY column_Name1 HAVING condition;  
```

### Example: Show how we can add the salary of employees for each city in employee table?
```
SELECT SUM(Emp_Salary), Emp_City FROM Employee GROUP BY Emp_City;  
```

### Example: Show those cities whose total salary of employees is more than 5000 in employee table?
```
SELECT SUM(Emp_Salary), Emp_City FROM Employee GROUP BY Emp_City HAVING SUM(Emp_Salary)>5000;  
```

### Example : show the age of those students whose roll number is more than and equals 502 in student table.
```
SELECT COUNT(Roll_No), Age FROM Student_details GROUP BY Age HAVING COUNT(Roll_No) >= 2 ;  
```

### Example : Show each city and the minimum salary in each city in employee table.
```
SELECT MIN(Emp_Salary), Emp_City FROM Employee GROUP BY Emp_City;  
```

- MAX Function with HAVING Clause
- MIN  Function with HAVING Clause
- AVG Function with HAVING Clause.

## SQL ORDER BY Clause
- Whenever we want to sort the records based on the columns stored in the tables of the SQL database, then we consider using the ORDER BY clause in SQL.
- The ORDER BY clause in SQL will help us to sort the records based on the specific column of a table. This means that all the values stored in the column on which we are applying ORDER BY clause will be sorted, and the corresponding column values will be displayed in the sequence in which we have obtained the values in the earlier step.
- Using the ORDER BY clause, we can sort the records in ascending or descending order as per our requirement. The records will be sorted in ascending order whenever the ASC keyword is used with ORDER by clause. DESC keyword will sort the records in descending order.
- If no keyword is specified after the column based on which we have to sort the records, in that case, the sorting will be done by default in the ascending order.

### Syntax to sort the records in ascending order:
```
SELECT ColumnName1,...,ColumnNameN FROM TableName  ORDER BY ColumnName ASC;    
```

### Syntax to sort the records in descending order:
```
SELECT ColumnName1,...,ColumnNameN FROM TableName  ORDER BY ColumnNameDESC;    
```

### Syntax to sort the records in ascending order without using ASC keyword:

```
SELECT ColumnName1,...,ColumnNameN FROM TableName  ORDER BY ColumnName;    
```

### Example: Write a query to sort the records in the ascending order of the customer names stored in the customers table.
SELECT *FROM customers ORDER BY Name ASC;

### Example 2: Write a query to sort the records in the ascending order of the addresses stored in the customers table.
SELECT *FROM customers ORDER BY Address;

### Example 3: Write a query to sort the records in the descending order of the customer salary stored in the customers table.
SELECT *FROM customers ORDER BY Salary DESC;

### Example 4: Write a query to sort the records in the descending order of the customer age stored in the customers table.
SELECT *FROM customers ORDER BY Age DESC;

## SQL ORDER BY RANDOM
- If you want the resulting record to be ordered randomly, you should use the following codes according to several databases.
```
Here is a question: what is the need to fetch a random record or a row from a database?
```
- Sometimes you may want to display random information like articles, links, pages, etc., to your user.
- If you want to fetch random rows from any of the databases, you have to use some altered queries according to the databases.

### Select a random row with MySQL:
```
SELECT column FROM table ORDER BY RAND () LIMIT 1;   
```

### SQL SORTING ON MULTIPLE COLUMNS
- Let's take an example of customer table which has many columns, the following SQL statement selects all customers from the table named "customer", stored by the "country" and "Customer-Name" columns:
```
SELECT * FROM customers  
ORDER BY country, Customer-Name;  
```

## SQL INSERT STATEMENT
- SQL INSERT statement is a SQL query. It is used to insert a single or a multiple records in a table.
- There are two ways to insert data in a table:

- By SQL insert into statement
 >- By specifying column names
 >- Without specifying column names
- By SQL insert into select statement

### Inserting data directly into a table
You can insert a row in the table by using SQL INSERT INTO command.
```
INSERT INTO table_name  
VALUES (value1, value2, value3....);  
``` 

```
INSERT INTO table_name (column1, column2, column3....)  
VALUES (value1, value2, value3.....);  
```
First Example

```
INSERT INTO STUDENTS (ROLL_NO, NAME, AGE, CITY)  
VALUES (1, Talha, 22, Lahore);  
INSERT INTO STUDENTS (ROLL_NO, NAME, AGE, CITY)  
VALUES (2, Dua, 20, Okara);  
INSERT INTO STUDENTS (ROLL_NO, NAME, AGE, CITY)  
VALUES (3, Imran, 21, Sahiwal);  
INSERT INTO STUDENTS (ROLL_NO, NAME, AGE, CITY)  
VALUES (4, Esha, 21, Multan);  
INSERT INTO STUDENTS (ROLL_NO, NAME, AGE, CITY)  
VALUES (5, Zainab, 23, Lahore);  
``` 

Second Example
```
INSERT INTO STUDENTS
VALUES (1, Talha, 22, Lahore);  
VALUES (2, Dua, 20, Okara);  
VALUES (3, Imran, 21, Sahiwal);  
VALUES (4, Esha, 21, Multan);  
VALUES (5, Zainab, 23, Lahore);
```

# MySQL Conditions:
    
- MySQL AND 
- MySQL OR
- MySQL AND OR
- MySQL Boolean
- MySQL LIKE
- MySQL IN
- MySQL ANY
- MySQL Exists
- MySQL NOT
- MySQL Not Equal
- MySQL IS NULL
- MySQL IS NOT NULL
- MySQL BETWEEN

### MySQL AND Condition
- The MySQL AND condition is used with SELECT, INSERT, UPDATE or DELETE statements to test two or more conditions in an individual query.

#### Syntax:
```
WHERE condition1  
AND condition2  
...  
AND condition_n;  
```

### MySQL OR Condition
The MySQL OR condition specifies that if you take two or more conditions then one of the conditions must be fulfilled to get the records as result.

### Syntax:
```
WHERE condition1  
OR condition2  
...  
OR condition_n;  
```

### MySQL AND & OR condition
In MySQL, you can use AND & OR condition both together with the SELECT, INSERT, UPDATE and DELETE statement. While combine these conditions, you must be aware where to use round brackets so that the database know the order to evaluate each condition.

#### Syntax:
```
WHERE condition1  
AND condition2  
...  
OR condition_n;  
```

## Example
```
SELECT *  
FROM students  
WHERE (course_name = 'Java' AND student_name = 'Ali')  
OR (student_id < 2);  
```

## MySQL Like
- The LIKE is a logical operator in the Structured Query Language. This SQL operator is used in the WHERE clause with the following three statements:

>- SELECT Statement
>- UPDATE Statement
>- DELETE Statement

- It filters the records from the columns based on the pattern specified in the SQL query.

Following are two wildcard characters that are used either in conjunction or independently with the SQL LIKE operator:

- % (percent sign): This wildcard character matches zero, one, or more than one character.
- _ (underscore sign): This wildcard character matches only one or a single character.

#### Syntax of the LIKE operator
```
SELECT column_Name1, column_Name2 ...., column_NameN FROM table_Name WHERE column_name LIKE pattern;   
```
- In this syntax, the pattern is a sequence of characters that have to be searched in that column which is just specified after the WHERE clause.

### Examples of LIKE Operator in MySQL
- Suppose, you want to filter the records of those employees whose names start with "S". 
- Suppose, you want to filter the records of those employees whose department name ends with "g".
- Suppose, you want to show the name and salary of those employees whose department name starts with "C" and ends with "g". 
- Suppose, you want to show all records of those employees from the above employee table whose Name contains the letter "a" in any position.
- Suppose, you want to show all records of those students whose Name contains "a" at the second position.
- Suppose, you want to access records of those students whose names contain at least 3 characters and starts with the letter "S".
- Suppose, you want to access Roll_No, Name, and Marks of those students whose Marks is 2 digits long and ends with '5':
-

## MySQL IN Condition
- The MySQL IN condition is used to reduce the use of multiple OR conditions in a SELECT, INSERT, UPDATE and DELETE statement.

### Syntax:
```
expression IN (value1, value2, .... value_n);  
```
### Parameters:

- value1, value2, ... or value_n: These are the values to test against expression. If any of these values matches expression, then the IN condition will evaluate to true. This is a quick method to test if any one of the values matches expression.

### Example:
Write a MySQL statement to check which books have either 300 or 400 or 500 pages.

#### Note:
 >- The MySQL NOT condition is opposite of MySQL IN condition. It is used to negate a condition in a SELECT, INSERT, UPDATE or DELETE statement.
 
 
### MySQL NOT Operator with IS NULL condition:
```
SELECT *  
FROM officers  
WHERE officer_name IS NOT NULL;  
``` 

### MySQL NOT Operator with LIKE condition:
```
SELECT *  
FROM officers  
WHERE officer_name NOT LIKE 'A%';  
``` 

### MySQL NOT Operator with BETWEEN condition:
```
SELECT *  
FROM officers  
WHERE officer_id NOT BETWEEN 3 AND 5;  
```

## The SQL ANY and ALL Operators
- The ANY and ALL operators allow you to perform a comparison between a single column value and a range of other values.

## The SQL ANY Operator

- returns a boolean value as a result
- returns TRUE if ANY of the subquery values meet the condition
- ANY means that the condition will be true if the operation is true for any of the values in the range.


#### ANY Syntax:
```
SELECT column_name(s)
FROM table_name
WHERE column_name operator ANY
  (SELECT column_name
  FROM table_name
  WHERE condition);
```
#### Note:
 >- The operator must be a standard comparison operator (=, <>, !=, >, >=, <, or <=).

## The SQL ALL Operator

- returns a boolean value as a result
- returns TRUE if ALL of the subquery values meet the condition
- is used with SELECT, WHERE and HAVING statements
- ALL means that the condition will be true only if the operation is true for all values in the range. 

### ALL Syntax With SELECT
```
SELECT ALL column_name(s)
FROM table_name
WHERE condition;
```

### ALL Syntax With WHERE or HAVING
```
SELECT column_name(s)
FROM table_name
WHERE column_name operator ALL
  (SELECT column_name
  FROM table_name
  WHERE condition);
```
#### Note: 
 >- The operator must be a standard comparison operator (=, <>, !=, >, >=, <, or <=).

## Examples

- 1 . The following SQL statement lists the ProductName if it finds ANY records in the OrderDetails table has Quantity equal to 10 (this will return TRUE because the Quantity column has some values of 10):
```
SELECT ProductName               
FROM Products            
WHERE ProductID = ANY                 
  (SELECT ProductID                
  FROM OrderDetails                 
  WHERE Quantity = 10);             
  
```

- 2. The following SQL statement lists the ProductName if it finds ANY records in the OrderDetails table has Quantity larger than 99 (this will return TRUE because the Quantity column has some values larger than 99):

```   
SELECT ProductName    
FROM Products     
WHERE ProductID = ANY    
  (SELECT ProductID     
  FROM OrderDetails     
  WHERE Quantity > 99);    
     
```

- 3. The following SQL statement lists the ProductName if it finds ANY records in the OrderDetails table has Quantity larger than 1000 (this will return FALSE because the Quantity column has no values larger than 1000):
```
SELECT ProductName             
FROM Products        
WHERE ProductID = ANY             
  (SELECT ProductID           
  FROM OrderDetails              
  WHERE Quantity > 1000);           
```

- The following SQL statement lists ALL the product names:

```
SELECT ALL ProductName        
FROM Products       
WHERE TRUE;     
```

- The following SQL statement lists the ProductName if ALL the records in the OrderDetails table has Quantity equal to 10. This will of course return FALSE because the Quantity column has many different values (not only the value of 10):


```
SELECT ProductName     
FROM Products     
WHERE ProductID = ALL     
  (SELECT ProductID     
  FROM OrderDetails      
  WHERE Quantity = 10);     
```

## MySQL Exists
- The EXISTS operator in MySQL is a type of Boolean operator which returns the true or false result. It is used in combination with a subquery and checks the existence of data in a subquery. It means if a subquery returns any record, this operator returns true. Otherwise, it will return false. The true value is always represented numeric value 1, and the false value represents 0. We can use it with SELECT, UPDATE, DELETE, INSERT statement.

### Syntax
```
SELECT col_names  
FROM tab_name  
WHERE [NOT] EXISTS (  
    SELECT col_names   
    FROM tab_name   
    WHERE condition  
); 
``` 
- The NOT operator is used to negates the EXISTS operator. It returns true when the subquery does not return any row. Otherwise, it returns false.

- Generally, the EXISTS query begins with SELECT *, but it can start with the SELECT column, SELECT a_constant, or anything in the subquery. It will give the same output because MySQL ignores the select list in the SUBQUERY.

- This operator terminates immediately for further processing after the matching result found. This feature improves the performance of the query in MySQL.

#### Note 
 >- MySQL EXISTS With DELETE Statement Example
 >- What is difference between IN and EXIST.

## MySQL Not Equal
- MySQL Not Equal is an inequality operator that used for returning a set of rows after comparing two expressions that are not equal. The MySQL contains two types of Not Equal operator, which are (< >) and (! =).

### Difference Between (< >) and (! =) Operator
- The Not Equal operators in MySQL works the same to perform an inequality test between two expressions. They always give the same result. However, they contain one difference that `< >` follows the ISO standard whereas `!=` does not follow ISO standard.

### Examples:
If ou want to get the student details who do not belong to England, then you need to execute the following statement:
```
SELECT * FROM students WHERE city <> "England";  
OR,

SELECT * FROM students WHERE city != "England";  
``` 

Inthis example, we are going to understand how the Not Equal operator works with multiple conditions in the WHERE clause. For example, we want to get the customer details where income is higher than 40000, and occupation is not a developer. 
```
SELECT * FROM customers Where income>40000 and occupation<>"Developer";  

```

## MySQL IS NULL Condition
- MySQL IS NULL condition is used to check if there is a NULL value in the expression. It is used with SELECT, INSERT, UPDATE and DELETE statement.

### Syntax:
```
expression IS NULL;  
```

## MySQL IS NOT NULL Condition
- MySQL IS NOT NULL condition is used to check the NOT NULL value in the expression. It is used with SELECT, INSERT, UPDATE and DELETE statements.

### Syntax:
```
expression IS NOT NULL ;
```

## MySQL BETWEEN Condition
- The MYSQL BETWEEN condition specifies how to retrieve values from an expression within a specific range. It is used with SELECT, INSERT, UPDATE and DELETE statement.

### Syntax:
```
expression BETWEEN value1 AND value2;    
```

#### MySQL BETWEEN condition with numeric value:
```
SELECT *  
FROM officers  
WHERE officer_id BETWEEN 1 AND 3; 
``` 


#### MySQL BETWEEN condition with date:
```
SELECT *  
FROM employees  
WHERE working_date BETWEEN CAST ('2015-01-24' AS DATE) AND CAST ('2015-01-25' AS DATE);  
```

## MySQL Aggregate Functions
- MySQL's aggregate function is used to perform calculations on multiple values and return the result in a single value like the average of all values, the sum of all values, and maximum & minimum value among certain groups of values. We mostly use the aggregate functions with SELECT statements in the data query languages.

### Syntax:
```
function_name (DISTINCT | ALL expression)  
```
In the above syntax, we had used the following parameters:

- First, we need to specify the name of the aggregate function.
- Second, we use the DISTINCT modifier when we want to calculate the result based on distinct values or ALL modifiers when we calculate all values, including duplicates. The default is ALL.
- Third, we need to specify the expression that involves columns and arithmetic operators.


### There are various aggregate functions available in MySQL.
- count()	It returns the number of rows, including rows with NULL values in a group.
- sum()	It returns the total summed values (Non-NULL) in a set.
- average()	It returns the average value of an expression.
- min()	It returns the minimum (lowest) value in a set.
- max()	It returns the maximum (highest) value in a set.
- first()	It returns the first value of an expression.
- last()	It returns the last value of an expression.

### Why we use aggregate functions?
- We mainly use the aggregate functions in databases, spreadsheets and many other data manipulation software packages. In the context of business, different organization levels need different information such as top levels managers interested in knowing whole figures and not the individual details. These functions produce the summarised data from our database. Thus they are extensively used in economics and finance to represent the economic health or stock and sector performance.

Let us take an example of netflix (video streaming website which has huge collections of the movie) database, where management may require the following details:

 >- Most rented movies.
 >- Least rented movies.
 >- Average number that each movie is rented out in a month.

We can easily produce these details with the help of aggregate functions.

## Eaxmples:
- Suppose we want to get the total number of employees in the employee table.
- Suppose can see the total working hours of all employees in the table.
- Suppose we can see that the average working hours of all employees in the organization.
- Suppose we can see that the minimum working hours of an employee available in the table.
- Suppose we can see that the maximum working hours of an employee available in the table.
- Suppose we can see that the first working date of an employee available in the table.
- Suppose we want to get the last working hour of an employee available in the table.
-

## Examples of MySQL Count() Function

- COUNT(*) Function: This function uses the SELECT statement to returns the count of rows in a result set. The result set contains all Non-Null, Null, and duplicates rows.

- COUNT(expression) Function: This function returns the result set without containing Null rows as the result of an expression.

- COUNT(distinct expression) Function: This function returns the count of distinct rows without containing NULL values as the result of the expression.

#### Syntax
```
SELECT COUNT (aggregate_expression)    
FROM table_name    
[WHERE conditions];    
```

#### Parameter explanation
- aggregate_expression: It specifies the column or expression whose NON-NULL values will be counted.
- table_name: It specifies the tables from where you want to retrieve records. There must be at least one table listed in the FROM clause.
- WHERE conditions: It is optional. It specifies the conditions that must be fulfilled for the records to be selected.

### Examples

- Execute the query that uses the COUNT(expression) function to calculates the total number of employees name available in the table.
- Execute the statement that returns all rows from the employee table and WHERE clause specifies the rows whose value in the column emp_age is greater than 32.
- Execute the statement that uses the COUNT(distinct expression) function that counts the Non-Null and distinct rows in the column emp_age/student_age.


#### MySQL Count() Function with GROUP BY Clause
We can also use the count() function with the GROUP BY clause that returns the count of the element in each group. For example, the following statement returns the number of employee in each city:
```
SELECT emp_name, city, COUNT(*) FROM employees GROUP BY city;  
```

#### MySQL Count() Function with HAVING and ORDER BY Clause
Let us see another clause that uses ORDER BY and Having clause with the count() function. Execute the following statement that gives the employee name who has at least two age same and sorts them based on the count result:
```
SELECT emp_name, emp_age, COUNT(*) FROM employees   
GROUP BY emp_age   
HAVING COUNT(*)>=2   
ORDER BY COUNT(*);  
```

## Examples of MySQL sum() function
- Execute the query that calculates the total number of working hours of all employees in the table.
- Execute the query to calculate the total working hours of employees whose working_hours >= 12.
- Execute the statement to calculates the total working hours of each employee by using the SUM() function with the GROUP BY clause.
-  Execute the statement that calculates the working hours of all employees, grouping them based on their occupation and returns the result whose Total_working_hours>24.
- Execute the  query that removes the duplicate records in the working_hours column of the employee table and then calculates the sum.
 >- Note: Use MySQL sum() function with DISTINCT clause

## Examples of MySQL AVG() function
- Execute the  query that calculates the average working hours of all employees in the table.
- Execute the query to calculate the total average working hours of employees whose working_hours >= 12.
- Execute the query to calculates the average working hours of each employee using the AVG() function and then group the result with the GROUP BY clause. Here GROUP BY `DEPARTMENT` Column.
- Execute the  query statement that calculates the average working hours of all employees, grouping them based on their occupation/department and returns the result whose Avg_working_hours>9.
- Execute the query that removes the duplicate records in the working_hours column of the employee table and then returns the average value. 
 >- Note: MySQL AVG() function with DISTINCT clause

## Examples of MySQL MIN() Function
- Execute the query that uses the MIN function to find the minimum income of the employee available in the table:
- Execute the statement to find the minimum income in all rows from the employee table and WHERE clause specifies all those rows whose emp_age column is greater than or equal to 32 and less than or equal to 40.
- Execute the statement  that uses the MIN() function with the GROUP BY clause to find the minimum income in all rows from the employee table for each emp_age/department group.
 >- NOTE: Use MySQL MIN() Function with GROUP BY Clause

- Execute the statement that returns the minimum income of all employees, grouping them based on their department/city and returns the result whose MIN(income)>150000.
 >- Note: Use MySQL MIN() Function with HAVING Clause
- Execute the query that removes the duplicate records in the salary/income column of the employee table, group by city/department, and then returns the minimum value. 
 >- Use: MySQL MIN() Function with DISTINCT Clause

## Example of MySQL MAX Function
- Execute the query that uses the MAX function to find the maximum income/salary of the employee available in the table.
- Execute the query that finds the maximum income/salary in all rows from the employee table. The WHERE clause specifies all those rows whose emp_age column is greater than 35 or department is `HR`.
- Execute the statement uses the MAX() function with the GROUP BY clause to find the maximum income/salary in all rows from the employee table for each emp_age/department group.
- Execute the statement that returns the maximum income/salary among all employees, grouping them based on their city/department and returns the result whose MAX(income) >= 200000.
- Execute the query that removes the duplicate records in the employee table's income/salary column, group by city/department, and then returns the maximum value.

-------------------------------------------
##### IMP Question:
-  Execute the query that returns all the details of a employee which has maximum/minimum salary from table.
```
SELECT * FROM ORG.Worker w 
WHERE   SALARY = 
(SELECT MAX(SALARY)
FROM ORG.Worker);
```
-  Select `first/last` five rows or values of specific column using `limit` and `desc` keyword.

# MySQL Unique Key
![](images/unique-key.png)

- A unique key in MySQL is a single field or combination of fields that ensure all values going to store into the column will be unique. It means a column cannot stores duplicate values. For example, the email addresses and roll numbers of students in the "student_info" table or contact number of employees in the "Employee" table should be unique.
- MySQL allows us to use more than one column with UNIQUE constraint in a table. 
- It ensures the integrity of the column or group of columns to store different values into a table.

### Needs of Unique Key
- It is useful in preventing the two records from storing identical values into the column.
- It stores only distinct values that maintain the integrity and reliability of the database for accessing the information in an organized way.
- It also works with a foreign key in preserving the uniqueness of a table.
- It can contain null value into the table.

### Syntax

- If we want to create only one unique key column into a table, use the syntax as below
```
CREATE TABLE table_name(  
    col1 datatype,  
    col2 datatype UNIQUE,  
    ...  
); 
```

- If we want to create more than one unique key column into a table, use the syntax as below
```
CREATE TABLE table_name(  
  col1 col_definition,  
  col2 col_definition,  
  ...  
  [CONSTRAINT constraint_name]  
  UNIQUE(column_name(s))  
); 
``` 
- If we have not specified the name for a unique constraint, MySQL generates a name for this column automatically. So, it is recommended to use the constraint name while creating a table.


#### Unique Key Example

- This statement creates a table "Student2" with a UNIQUE constraint.
```
CREATE TABLE Student2 (  
    Stud_ID int NOT NULL UNIQUE,   
    Name varchar(45),   
    Email varchar(45),  
    Age int,   
    City varchar(25)  
); 
```
            
Next, execute the insert queries listed below to understand how it works:
```            
INSERT INTO Student2 (Stud_ID, Name, Email, Age, City)  
VALUES (1, 'Peter', 'peter@javatpoint.com', 22, 'Texas'),  
(2, 'Suzi', 'suzi@javatpoint.com', 24, 'California'),  
(3, 'Joseph', 'joseph@javatpoint.com', 23, 'Alaska');  
  
INSERT INTO Student2 (Stud_ID, Name, Email, Age, City)  
VALUES (1, 'Stephen', 'stephen@javatpoint.com', 22, 'Texas');  

```
![](images/mysql-unique-key.png)

- If you want to define the unique key on multiple columns, use the query as below:

```
CREATE TABLE Student3 (  
    Stud_ID int,   
    Roll_No int,  
    Name varchar(45) NOT NULL,   
    Email varchar(45),  
    Age int,   
    City varchar(25),  
    CONSTRAINT uc_rollno_email Unique(Roll_No, Email)  
); 
```
![](images/mysql-unique-key2.png)

To verify this, execute the following statement:
```
SHOW INDEX FROM Student3;  
```

### DROP Unique Key
- The ALTER TABLE statement also allows us to drop the unique key from the table. 
#### Syntax:
Syntax:
```
ALTER TABLE table_name  DROP INDEX constraint_name;  
```
- In the above syntax, the table_name is the name of the table that we want to modify, and constraint_name is the name of the unique key we are going to remove.

### Unique Key Using ALTER TABLE Statement
- This statement allows us to do the modification into the existing table. Sometimes we want to add a unique key to the column of an existing table; then, this statement is used to add the unique key for that column.

#### Syntax
```
ALTER TABLE table_name ADD CONSTRAINT constraint_name UNIQUE(column_list); 
```

## MySQL Primary Key
- MySQL primary key is a single or combination of the field, which is used to identify each record in a table uniquely. If the column contains primary key constraints, then it cannot be null or empty. A table may have duplicate columns, but it can contain only one primary key. It always contains unique value into a column.


### Rules for Primary key

- The primary key column value must be unique.
- Each table can contain only one primary key.
- The primary key column cannot be null or empty.
- MySQL does not allow us to insert a new row with the existing primary key.
- It is recommended to use INT or BIGINT data type for the primary key column.

#### We can create a primary key in two ways:
 >- CREATE TABLE Statement
 >- ALTER TABLE Statement
 
<img src="images/030819_0835_SQLServerPR1.png" height=600px width=600px>

### Example to create primary key
```
CREATE TABLE Login(  
   login_id INT AUTO_INCREMENT PRIMARY KEY,  
   username VARCHAR(40),  
   password VARCHAR(55),  
   email VARCHAR(55)  
); 
```
```
INSERT INTO Login(login_id, username, password, email)   
VALUES (1,'Stephen', 15343434532, 'stephen@javatpoint.com'),   
(2, 'Joseph', 35435479495, 'Joseph@javatpoint.com');  
  
INSERT INTO Login(login_id, username, password, email)   
VALUES (1,'Peter', 15343434532, 'peter@javatpoint.com');  
```
![](images/mysql-primary-key.png)

#### IMP Questions:
- Can we define the primary key on multiple columns?
-  Add a column of a table using `primary key using alter table statement`.\
- How we can drop primary key from the table using `DROP Primary Key`.

#### Difference between Primary and Unique key
- It is a single or combination of the field, which is used to identify each record in a table uniquely while It also determines each row of the table uniquely in the absence of a primary key.
- A table can have only one primary key while A table can have more than one unique key.
- It creates a clustered index while unique key creates a non-clustered index.

## MySQL Foreign Key
- The foreign key is used to link one or more than one table together. It is also known as the referencing key. A foreign key matches the primary key field of another table. It means a foreign key field in one table refers to the primary key field of the other table. It identifies each row of another table uniquely that maintains the referential integrity in MySQL.

- A foreign key makes it possible to create a parent-child relationship with the tables. In this relationship, the parent table holds the initial column values, and column values of child table reference the parent column values. MySQL allows us to define a foreign key constraint on the child table.

- MySQL defines the foreign key in two ways:
 >- Using CREATE TABLE Statement
 >- Using ALTER TABLE Statement
 
<img src='images/foreign-key-in-dbms3.png'>

### SQL FOREIGN KEY on CREATE TABLE
- The following SQL creates a FOREIGN KEY on the "PersonID" column when the "Orders" table is created:
```
CREATE TABLE Orders (
    OrderID int NOT NULL,
    OrderNumber int NOT NULL,
    PersonID int,
    PRIMARY KEY (OrderID),
    FOREIGN KEY (PersonID) REFERENCES Persons(PersonID)
);
```

## Introduction to MySQL LIMIT clause

# Environment Setup
- To build the real world applications, connecting with the databases is the necessity for the programming languages. However, python allows us to connect our application to the databases like MySQL, SQLite, MongoDB, and many others.

### Install mysql.connector
- To connect the python application with the MySQL database, we must import the mysql.connector module in the program.
- The mysql.connector is not a built-in module that comes with the python installation. We need to install it to get it working.
- Execute the following command to install it using pip installer.

`pip install mysql-connector`

## Database Connection
There are the following steps to connect a python application to our database.

- Import mysql.connector module
- Create the connection object.
- Create the cursor object
- Execute the query

## Creating the connection
- To create a connection between the MySQL database and the python application, the connect() method of mysql.connector module is used.
- Pass the database details like HostName, username, and the database password in the method call. The method returns the connection object.

#### The syntax to use the connect() is given below.
```
Connection-Object= mysql.connector.connect(host = <host-name> , user = <username> , passwd = <password> , databaseName = <database>)  
```

In [ ]:
import mysql.connector
conn = mysql.connector.connect(host="localhost", user='root', password = 'Pucit12345#', database = 'Hospital')
print(conn)
cur = conn.cursor()
print(cur)

In [ ]:
import mysql.connector  
  
#Create the connection object   
myconn = mysql.connector.connect(host = "localhost", user = "root",passwd = "google")  
  
#printing the connection object   
print(myconn)

## Creating a cursor object
The cursor object can be defined as an abstraction specified in the Python DB-API 2.0. It facilitates us to have multiple separate working environments through the same connection to the database. We can create the cursor object by calling the 'cursor' function of the connection object. The cursor object is an important aspect of executing queries to the databases.

#### The syntax to create the cursor object is given below.
```
<my_cur>  = conn.cursor()  
```

In [41]:
# import mysql.connector  
# #Create the connection object   
# myconn = mysql.connector.connect(host = "localhost", user = "root",passwd = "google", database = "mydb")  
  
# #printing the connection object   
# print(myconn)   
  
# #creating the cursor object  
# cur = myconn.cursor()  
  
# print(cur)

### Getting the list of existing databases
We can get the list of all the databases by using the following MySQL query.
```
show databases;  
```

In [ ]:
import mysql.connector  
  
#Create the connection object   
myconn = mysql.connector.connect(host = "localhost", user = "root",passwd = "google")  
  
#creating the cursor object  
cur = myconn.cursor()  
  
try:  
    dbs = cur.execute("show databases")  
except:  
    myconn.rollback()  
for x in cur:  
    print(x)  
myconn.close()

In [ ]:
import mysql.connector
conn = mysql.connector.connect(host="localhost", user='root', password = 'Pucit12345#', database = 'Hospital')
print(conn)
cur = conn.cursor()
print(cur)
try:
    dbNames = cur.execute("show databases")
except:
    conn.rollback()
for x in cur:
    print(x)
conn.close()

In [53]:
conn.close()

### Creating the new database
The new database can be created by using the following SQL query.
```
create database <database-name>    
```

In [ ]:
import mysql.connector  
  
#Create the connection object   
myconn = mysql.connector.connect(host = "localhost", user = "root",passwd = "google")  
  
#creating the cursor object  
cur = myconn.cursor()  
  
try:  
    #creating a new database  
    cur.execute("create database PythonDB2")  
  
    #getting the list of all the databases which will now include the new database PythonDB  
    dbs = cur.execute("show databases")  
      
except:  
    myconn.rollback()  
for x in cur:  
        print(x)  
          
myconn.close()

In [ ]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Pucit12345#",
  database="ehtisham",
  auth_plugin='mysql_native_password'
)
cur = mydb.cursor()  
sql = "insert into STUDENTS(ID, NAME, AGE, ADDRESS) values (%s, %s, %s, %s)"  
  
#The row values are provided in the form of tuple   
val = (110,'Ahmed', 20 , "Lahore")  
  
try:  
    cur.execute(sql,val)  
    mydb.commit()
except:  
    mydb.rollback()  
print(cur.rowcount,"record inserted!")  
mydb.close()

In [ ]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Pucit12345#",
  database="ehtisham",
  auth_plugin='mysql_native_password'
)
cur = mydb.cursor()  
try:  
    #Reading the Employee data      
    cur.execute("select * from STUDENTS")  
  
    #fetching the rows from the cursor object  
    result = cur.fetchall()  
    #printing the result  
      
    for x in result:  
        print(x);  
except:  
    mydb.rollback()  
mydb.close()

In [ ]:
import mysql.connector
conn = mysql.connector.connect(host='localhost', user= 'root', password = 'Pucit12345#', database='DB3')
cur = conn.cursor()
sql = "insert into students(ROLL_NO, NAME, Age, City) values (%s, %s, %s, %s)"
values = (6, 'Azka Noreen', 21, 'Multan')
try:
    cur.execute(sql,values)
    conn.commit()
except:
    conn.rollback()
    
print("Total rows : ", cur.rowcount, 'inserted!')
conn.close()

In [ ]:
import mysql.connector
conn = mysql.connector.connect(host='localhost', user= 'root', password = 'Pucit12345#', database='DB3')
cur = conn.cursor()
try:
    cur.execute("select * from students")
    for i in cur.fetchall():
        print(i)
except:
    conn.rollback()
conn.close()

### Update operation

In [ ]:
import mysql.connector  
  
#Create the connection object   
myconn = mysql.connector.connect(host = "localhost", user = "root",passwd = "google",database = "PythonDB")  
  
#creating the cursor object  
cur = myconn.cursor()  
  
try:  
    #updating the name of the employee whose id is 110  
    cur.execute("update Employee set name = 'alex' where id = 110")  
    myconn.commit()  
except:  
      
    myconn.rollback()  
myconn.close()

In [ ]:
import mysql.connector  
  
#Create the connection object   
myconn = mysql.connector.connect(host = "localhost", user = "root",passwd = "google",database = "PythonDB")  
  
#creating the cursor object  
cur = myconn.cursor()  
  
try:  
    #Deleting the employee details whose id is 110  
    cur.execute("delete from Employee where id = 110")  
    myconn.commit()  
except:  
      
    myconn.rollback()  
  
myconn.close()

## Performing Transactions
Transactions ensure the data consistency of the database. We have to make sure that more than one applications must not modify the records while performing the database operations. The transactions have the following properties.

- Atomicity : Either the transaction completes, or nothing happens. If a transaction contains 4 queries then all these queries must be executed, or none of them must be executed.
- Consistency : The database must be consistent before the transaction starts and the database must also be consistent after the transaction is completed.
- Isolation : Intermediate results of a transaction are not visible outside the current transaction.
- Durability : Once a transaction was committed, the effects are persistent, even after a system failure.

### Python commit() method
Python provides the commit() method which ensures the changes made to the database consistently take place.
#### The syntax to use the commit() method
```
conn.commit() #conn is the connection object  
```
- All the operations that modify the records of the database do not take place until the commit() is called.

### Python rollback() method
- The rollback() method is used to revert the changes that are done to the database. This method is useful in the sense that, if some error occurs during the database operations, we can rollback that transaction to maintain the database consistency.

#### The syntax to use the rollback() 
```
Conn.rollback()  
```

### Closing the connection
We need to close the database connection once we have done all the operations regarding the database. Python provides the close() method. 
#### The syntax to use the close() method 
```
conn.close()   
```

In [ ]:

# import mysql.connector
# create connection object using, connect function of mysql.connector
# create cursor object
# Execute query using execute functionm of cur object.
# Commit your connection.
# if there is error in your connection, then conn.rollback

In [ ]:
import mysql.connector
conn = mysql.connector.connect(host = 'localhost', user = 'root', password = 'Pucit12345#', database = 'DB3')
cur = conn.cursor()
sql = "select * from students"
try:
    cur.execute(sql)
    result  = cur.fetchall()
    for i in result:
        print(i)
    conn.commit()
except:
    print("Error in your connection")
    conn.rollback()
conn.close()

In [1]:
from IPython.core.display import HTML

style = """
    <style>
        body {
            background-color: #f2fff2;
        }
        h1 {
            text-align: center;
            font-weight: bold;
            font-size: 36px;
            color: #4295F4;
            text-decoration: underline;
            padding-top: 15px;
        }
        
        h2 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #4A000A;
            text-decoration: underline;
            padding-top: 10px;
        }
        
        h3 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #f0081e;
            text-decoration: underline;
            padding-top: 5px;
        }

        
        p {
            text-align: center;
            font-size: 12 px;
            color: #0B9923;
        }
    </style>
"""

html_content = """
<h1>Hello</h1>
<p>Hello World</p>
<h2> Hello</h2>
<h3> World </h3>
"""

HTML(style + html_content)